lexbn-source.org
#+title: @lexseltmann
#+author: Alex Seltmann
#+hugo_base_dir: .
#+options: creator:t
#+hugo_auto_set_lastmod: t

#+hugo_pandoc_citations: t
#+bibliography: cite/references.bib
#+bibliography: cite/books.bib

** TODO Advent of code 2023 - Day 5: If You Give A Seed A Fertilizer :python:
:PROPERTIES:
:EXPORT_FILE_NAME: aoc2023-day05.en.md
:header-args:jupyter-python: :session /jpy:localhost#8888:b37e524a-8134-4d8f-b24a-367acaf1bdd3 :pandoc t :kernel python3 :exports both
:END:

This year I try to record my attempt at solving the *Advent of Code 2023*
riddles. This is Day 5 - see [[https:adventofcode.com/2023/day/5]]
