content/posts/aoc2023-day05.en.md
+++
title = "Advent of code 2023 - Day 5: If You Give A Seed A Fertilizer"
author = ["Alex Seltmann"]
lastmod = 2023-12-30T00:49:06+01:00
tags = ["python"]
draft = true
creator = "Emacs 29.1 (Org mode 9.7 + ox-hugo)"
+++

This year I try to record my attempt at solving the **Advent of Code 2023**
riddles. This is Day 5 - see <https:adventofcode.com/2023/day/5>
