lexbn-source.org
*** Part 2

#+begin_quote
Everyone will starve if you only plant such a small number of seeds. Re-reading
the almanac, it looks like the =seeds:= line actually describes *ranges of seed
numbers*.

The values on the initial =seeds:= line come in pairs. Within each pair, the
first value is the *start* of the range and the second value is the *length* of
the range. So, in the first line of the example above:

=seeds: 79 14 55 13=

This line describes two ranges of seed numbers to be planted in the garden. The
first range starts with seed number =79= and contains =14= values: =79=, =80=,
..., =91=, =92=. The second range starts with seed number =55= and contains =13=
values: =55=, =56=, ..., =66=, =67=.

Now, rather than considering four seed numbers, you need to consider a total of
=27= seed numbers.

In the above example, the lowest location number can be obtained from seed
number =82=, which corresponds to soil =84=, fertilizer =84=, water =84=, light
=77=, temperature =45=, humidity =46=, and location =46=. So, the lowest
location number is =46=.

Consider all of the initial seed numbers listed in the ranges on the first line
of the almanac. *What is the lowest location number that corresponds to any of
the initial seed numbers?*
#+end_quote

Let's first construct a dataframe containing the range of seeds:

#+begin_src jupyter-python
  seeds_df = pd.DataFrame({'start': seeds[::2],
                           'range': seeds[1::2],
                           'end': seeds[::2] + seeds[1::2]})
  print(f'There are {sum(seeds_df.loc[:, "range"]):_} seeds in total')
  seeds_df

#+end_src

#+RESULTS:
:RESULTS:
: There are 2_549_759_327 seeds in total
|   | start      | range     | end        |
|---+------------+-----------+------------|
| 0 | 3169137700 | 271717609 | 3440855309 |
| 1 | 3522125441 | 23376095  | 3545501536 |
| 2 | 1233948799 | 811833837 | 2045782636 |
| 3 | 280549587  | 703867355 | 984416942  |
| 4 | 166086528  | 44766996  | 210853524  |
| 5 | 2326968141 | 69162222  | 2396130363 |
| 6 | 2698492851 | 14603069  | 2713095920 |
| 7 | 2755327667 | 348999531 | 3104327198 |
| 8 | 2600461189 | 92332846  | 2692794035 |
| 9 | 1054656969 | 169099767 | 1223756736 |
:END:

Now - I really needed some time to finally realize, that going through all seed
values is really unfeasable. So how do we deal with this problem?

In the end, we need the lowest location number - thus our approach is to take
the =humi_loc= map (where ~dest_start \== 0~), start with the lowest location
number and go up and get the corresponding seed values. The location of the
first seed value which is inside =seeds_df= is our solution.

So first we rebuild the =get_location= function to a =get_seed= function (we
reverse the =maps= tuple with =maps[::-1]= and switch =src= and =dest=).

#+begin_src jupyter-python :results scalar
  def get_seed(location):
      current = location
      for df in maps[::-1]:
          current_map = [row
                         for row in df.itertuples()
                         if ((current >= row.dest_start)
                             and (current < row.dest_end))]
          if len(current_map) == 0:
              pass
          elif len(current_map) == 1:
              current = (current_map[0].src_start
                         + (current - current_map[0].dest_start))
          else:
              raise ValueError('This should not happen!')
      return current
#+end_src

#+RESULTS:

To go through the possible locations efficiently, I decided to use a Python
*generator function* to go through the locations - this function does not store
the full list of =105_449_249= possible locations in the first batch
(=humi_loc.loc[9, 'dest_start']=) in memory - nice for our big numbers.

Lastly, we deal with the sheer amount of possible values by performing a *grid
search*. First, we check every millionth location. After the first match, we
stop this search and check the last million locations before the match with a
finer grid and so on. The last grid is just =1=, so we find our lowest location.

#+begin_src jupyter-python
  def get_generator(start, end, step=1):
      next = start
      while next < end:
          yield next
          next += step

  def grid_search(start: int, end: int, grid: list[int]):
      for g in grid:
          print(f'Start search with grid={g}')
          loc_gen = get_generator(start, end, g)
          for l in loc_gen:
              current = get_seed(l)
              if any((current >= seeds_df.loc[:, 'start']) & (current < seeds_df.loc[:, 'end'])):
                  print(f'location {l} is the lowest which contains one of the given seeds ({current})')
                  start = l - g
                  end = l
                  break
      print('Finished search')

  grid_search(start=humi_loc.loc[9, 'dest_start'],
              end=humi_loc.loc[9, 'dest_end'],
              grid=[1_000_000, 100_000, 1000, 1])
#+end_src

#+RESULTS:
: Start search with grid=1000000
: location 85000000 is the lowest which contains one of the given seeds (2605777210)
: Start search with grid=100000
: location 84300000 is the lowest which contains one of the given seeds (2605077210)
: Start search with grid=1000
: location 84207000 is the lowest which contains one of the given seeds (2604984210)
: Start search with grid=1
: location 84206669 is the lowest which contains one of the given seeds (2604983879)
: Finished search

